title: Encrypted CommandLine In Powershell
id: 66e563f9-1cbd-4a22-a957-d8b7c0h44372
status: test
description: Detects suspicious use of XORDump process memory dumping utility
references:
    - https://github.com/audibleblink/xordump
author: Tomasz Dyduch
date: 2022-01-28
modified: 2023-02-08
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
        - OriginalFileName:
            - 'PowerShell.exe'
            - 'pwsh.dll'
    selection_cli:
        CommandLine|contains: '-EncodedCommand'
    condition: all of selection_*
falsepositives:
    - Another tool that uses the command line switches of XORdump
level: high
