title: Encrypted CommandLine In Powershell
id: 92cdec4f-9d3e-4ac0-94ec-32c05adbe7f7
status: test
description: Detects suspicious use of XORDump process memory dumping utility
references:
    - https://github.com/audibleblink/xordump
author: Tomasz Dyduch
date: 2022-01-28
modified: 2023-02-08
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
detection:
    selection_img:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
    selection_cli:
        CommandLine|contains: '-EncodedCommand'
    condition: all of selection_*
falsepositives:
    - Another tool that uses the command line switches of XORdump
level: high
